{
    "ocean_heart": [
        "You are my ocean — deep, endless, and beautifully mysterious.",
        "Like the waves, my love for you will never stop reaching for you.",
        "You are the calm in my storm and the tide that pulls me home.",
        "My heart is an ocean, and every wave whispers your name.",
        "In the sea of life, you are my anchor and my horizon.",
        "Our love flows like the ocean — vast, powerful, and eternal.",
        "You are the pearl I found in the deepest part of my heart.",
        "Every wave that touches the shore carries my love to you.",
        "You make my heart feel like an endless, beautiful ocean.",
        "Like the sea and the sky, we were made to meet at the horizon.",
        "My love for you is deeper than the deepest ocean floor.",
        "You are the lighthouse that guides my heart safely home.",
        "Our love is like the tide — it always finds its way back.",
        "With you, I have found an ocean of happiness I never want to leave.",
        "You are my sun over the water, making everything sparkle.",
        "In the ocean of my heart, you are the most precious treasure.",
        "Like the moon pulls the tide, you pull me closer every day.",
        "You are the shore my heart has been sailing toward all along.",
        "Our love is a beautiful ocean — sometimes wild, always wonderful.",
        "My heart beats for you like the waves beat against the shore.",
        "You are the current that moves my soul in beautiful directions.",
        "The depth of my love for you could fill every ocean on earth.",
        "You are my forever wave — always coming back to me.",
        "With every heartbeat, I send you an ocean of love.",
        "You are the most beautiful thing the sea of life has given me.",
        "Like a seashell holds the sound of the ocean, my heart holds you.",
        "Our love is eternal, like the ocean that never runs dry.",
        "You are the reason my heart overflows like the sea.",
        "In the vast ocean of the world, finding you was my greatest blessing."
    ],
    "fire_rose": [
        "You set my heart on fire, and I never want the flame to die.",
        "Like a rose that blooms in fire, our love is rare and beautiful.",
        "My passion for you burns brighter than a thousand flames.",
        "You are the fire in my soul and the rose in my heart.",
        "Our love burns with a fire that nothing can extinguish.",
        "You are my eternal flame — beautiful, warm, and impossible to ignore.",
        "Like a rose born from fire, you are beauty and strength combined.",
        "My heart burns for you with a love that will never fade.",
        "You are the spark that ignited the greatest love of my life.",
        "Every petal of my love for you is forged in passion and fire.",
        "You are my wildfire — untamed, breathtaking, and unforgettable.",
        "Like a fire rose, our love is something the world has never seen.",
        "My love for you is a flame that will burn for all eternity.",
        "You are the heat in my soul and the beauty in my days.",
        "Our love is a garden of fire roses — fierce, bold, and alive.",
        "You light up my world like a flame lights up the darkest night.",
        "Every moment with you adds fuel to the fire in my heart.",
        "You are the most beautiful flame I have ever known.",
        "Like a fire that never dies, my love for you is eternal.",
        "You are the rose that grows where others see only ashes.",
        "My heart blooms for you like a rose kissed by fire.",
        "Our passion is a flame that dances with every beat of my heart.",
        "You are the warmth I crave and the fire I never want to lose.",
        "Like a burning rose, you are delicate, fierce, and one of a kind.",
        "My love for you is a fire that only grows stronger with time.",
        "You are the flame that melts the coldest parts of my soul.",
        "Every day with you is a rose petal added to our eternal fire.",
        "You are my fire rose — rare, radiant, and fiercely loved.",
        "In the garden of my heart, you are the most fiery bloom."
    ],
    "ring_flames": [
        "This ring of flames is my promise — I will love you with all I have.",
        "Like a ring of fire, my devotion to you has no beginning and no end.",
        "You are the flame that circles my heart and never lets go.",
        "Our commitment burns bright like an eternal ring of flames.",
        "I give you this ring of fire as a symbol of my undying love.",
        "You are the circle that completes me — unbroken and ablaze.",
        "My love for you is like a ring of flames — fierce, full, and forever.",
        "With this gift, I seal my heart to yours in a ring of fire.",
        "Our love is forged in fire and shaped into an unbreakable ring.",
        "You are the flame that keeps our bond burning through every season.",
        "Like a ring of flames, our love lights up everything around us.",
        "I choose you today and every day — in fire and in devotion.",
        "Our love burns in a circle — no end, no escape, just us.",
        "You are the fire that crowns my heart with eternal devotion.",
        "This ring of flames represents a love that will outlast time itself.",
        "You are the burning promise I carry with me everywhere I go.",
        "My devotion to you is a fire that wraps around my soul.",
        "Like an eternal ring of flames, my love for you never fades.",
        "You are the spark that created the endless circle of my love.",
        "With every flame in this ring, I promise to love you more.",
        "Our love is a sacred fire that burns in an unbreakable circle.",
        "You are the one who turned my spark into a ring of flames.",
        "I walk through fire for you — gladly, willingly, always.",
        "This ring of flames is my commitment to us — forever and always.",
        "You are the fire that holds our love together, strong and bright.",
        "Like flames that dance in a ring, we move together in perfect harmony.",
        "Our bond is a ring of fire — powerful, passionate, and pure.",
        "You are my eternal flame, and this ring is my forever promise.",
        "In the circle of our love, every flame tells the story of us."
    ],
    "mythic_rose": [
        "Our love is the stuff of legends — mythic, timeless, and extraordinary.",
        "You are the rose that even the greatest myths couldn't imagine.",
        "Like a legendary bloom, your beauty defies all understanding.",
        "Our love story is so beautiful, it belongs in the pages of myth.",
        "You are my mythic rose — born of legend, blooming in my heart.",
        "No fairy tale could capture the magic of what we share.",
        "You are the legend my heart was always searching for.",
        "Like a mythic rose, our love is rare, powerful, and unforgettable.",
        "You are the greatest love story ever told — and you are mine.",
        "Our love is legendary, and every moment with you is a new chapter.",
        "You are the mythic bloom that makes the impossible feel real.",
        "Legends will speak of the way you captured my heart forever.",
        "You are the rose that grows in the garden of the gods.",
        "Our love is a myth come to life — grand, epic, and eternal.",
        "You are the legend that my heart whispers about at night.",
        "Like a rose from an ancient tale, you are breathtakingly rare.",
        "Our love is so extraordinary, it could only be written by fate.",
        "You are the mythic bloom that turned my ordinary world into magic.",
        "Legends are born from great love stories — ours is the greatest.",
        "You are the rose that heroes in stories search a lifetime for.",
        "My love for you is so grand, it deserves its own mythology.",
        "You are the myth my heart believed in before I ever met you.",
        "Like a legendary rose, your love has the power to transform worlds.",
        "Our love is a myth unfolding — beautiful, wild, and destined.",
        "You are the bloom that legends grow around — radiant and iconic.",
        "No story ever told is as beautiful as the one we are living.",
        "You are my mythic rose — ageless, priceless, and deeply loved.",
        "The greatest myth of all is that I found someone as perfect as you.",
        "Our love is a legend in the making — and it has only just begun."
    ],
    "aurora_throne": [
        "You are the aurora that lights up the sky of my life.",
        "Like a queen on her throne, you reign supreme in my heart.",
        "You are the royal glow that makes everything around you beautiful.",
        "Our love is a celestial event — rare, magnificent, and awe-inspiring.",
        "You deserve a throne, and I will spend my life building it for you.",
        "Like the aurora, your love paints my world in the most beautiful colors.",
        "You are the crown jewel of my universe — brilliant and majestic.",
        "Our love shines across the sky like the northern lights at midnight.",
        "You are the queen of my heart, and your throne is made of starlight.",
        "Like a celestial aurora, you are a wonder that never gets old.",
        "You are the light that turns my darkest nights into something magical.",
        "Royalty runs through your love — it is regal, graceful, and grand.",
        "You are the aurora that dances across the sky of my soul.",
        "Our love is a throne built on trust, respect, and endless admiration.",
        "You are the celestial queen who conquered my heart effortlessly.",
        "Like the aurora that crowns the night sky, you crown my life.",
        "You are the majesty that makes every moment feel like a celebration.",
        "Our love is a throne of light — beautiful, powerful, and eternal.",
        "You are the reason I look up — you are my aurora, my sky.",
        "Like a queen on a throne of stars, you illuminate everything you touch.",
        "You bring the majesty of the aurora into every moment we share.",
        "Our love is as grand as a celestial throne — unshakable and radiant.",
        "You are the glow that lights up the kingdom of my heart.",
        "Like the northern lights, you are a spectacle of beauty and wonder.",
        "You are the throne my heart bows to — willingly and lovingly.",
        "Our love is a celestial masterpiece painted across the sky.",
        "You are my aurora — rare, magnificent, and the light of my life.",
        "Like a throne made of light, our love is majestic and unbreakable.",
        "You are the celestial force that keeps my heart in orbit around yours."
    ],
    "dragon_love": [
        "Our love is dragonfire — fierce, unstoppable, and legendary.",
        "You are the fire-breathing force that conquered my heart forever.",
        "Like a dragon guards its treasure, I will guard our love always.",
        "Our love has the strength of a dragon and the tenderness of a flame.",
        "You are my dragon heart — powerful, loyal, and fearless in love.",
        "Together, we are an unstoppable force — bound by dragonfire love.",
        "You are the epic love that even dragons would bow before.",
        "Our bond is forged in dragonfire — unbreakable and eternal.",
        "Like a dragon soaring through the sky, our love knows no limits.",
        "You are the treasure that a thousand dragons couldn't keep from me.",
        "Our love is a dragon's flight — breathtaking, free, and boundless.",
        "You are the flame in my dragon heart that will never go out.",
        "Like a dragon's destiny, you were written into the story of my life.",
        "Our love is so powerful, it shakes the mountains and parts the seas.",
        "You are the dragonrider of my heart — brave, bold, and beautiful.",
        "Together, we breathe fire into the world — our love is legendary.",
        "You are the epic tale of love that dragons tell to their young.",
        "Our love has wings — it soars above everything that tries to hold it down.",
        "You are my dragonbound destiny — chosen by fate, sealed by love.",
        "Like dragonfire, my love for you burns with an intensity nothing can match.",
        "You are the strength that makes me feel like I can conquer anything.",
        "Our love is the stuff of dragon legends — epic, eternal, and grand.",
        "You are the fire that fuels the dragon in my soul.",
        "Like a dragon protects its hoard, I will protect our love fiercely.",
        "You are the most epic love I have ever known — my dragon, my heart.",
        "Our bond is sealed in dragonfire — nothing in this world can break it.",
        "You are the wings that lift my heart above the ordinary.",
        "Like a dragon's roar echoes through the mountains, my love echoes for you.",
        "You are my dragonbound love — fierce, loyal, and forever destined."
    ],
    "yinyang_love": [
        "You are the yin to my yang — together, we are perfectly whole.",
        "Like yin and yang, we balance each other in the most beautiful way.",
        "Our love is harmony itself — two souls perfectly intertwined.",
        "You complete me the way yin completes yang — naturally and eternally.",
        "We are the balance the universe created — light and shadow, one love.",
        "Like yin and yang, our differences make us stronger together.",
        "You are the calm to my storm and the light to my shadow.",
        "Our love is a circle of balance — everything I need, you provide.",
        "You are my cosmic other half — the yin to my yang, always.",
        "Like the ancient symbol of harmony, our love is timeless and whole.",
        "We fit together like yin and yang — perfectly, beautifully, inevitably.",
        "You are the balance that keeps my world spinning in harmony.",
        "Our souls dance like yin and yang — different, yet perfectly united.",
        "You are the missing piece of my soul that makes everything complete.",
        "Like yin and yang, our love is proof that opposites create perfection.",
        "You are the harmony my heart craves — my mystic, my balance, my all.",
        "Our love is a sacred balance — strong in light, beautiful in shadow.",
        "You are the yang to my yin — fierce where I am gentle, gentle where I am fierce.",
        "Like yin and yang, we are two halves of one infinite love.",
        "You are my cosmic balance — the love that makes my soul complete.",
        "Our bond is like yin and yang — inseparable and meant to be.",
        "You are the light in my darkness and the peace in my chaos.",
        "Like the mystic flow of yin and yang, our love is effortless and true.",
        "You are the equilibrium that keeps my heart perfectly centered.",
        "Our love is a circle with no end — balanced, whole, and eternal.",
        "You are my soul's counterpart — the yin to my yang, forever.",
        "Like yin and yang, our love tells the story of two becoming one.",
        "You are the harmony that turns my life into a beautiful symphony.",
        "In the dance of yin and yang, I found my forever partner in you."
    ]
}